import React from 'react';
import { StyledContainer } from './style';
import { Stack, Typography } from '@mui/material';

const InfoContent = () => {
  return (
    <StyledContainer maxWidth="xl" disableGutters>
      <Stack spacing={3}>
        <Typography variant="h4">Зміст інформації</Typography>
        <Typography whiteSpace="pre-line" variant="body1">{`ЗМІСТ ІНФОРМАЦІЇ

          3. Адміністрація маркетплейсу має право повністю або частково обмежити доступ до інформації у разі, якщо вона містить:
          3.1. дані інших користувачів маркетплейсу, конфіденційну інформацію про фізичних осіб (їх персональні дані), а також матеріали, що містять державну, банківську таємницю; інформацію про інших користувачів (юридичних та фізичних осіб-підприємців), які вже представлені на маркетплейсі. Виняток - платні реєстрації;
          
          3.2. інформацію, яка не відповідає тематиці маркетплейсу і не пов'язана з веденням господарської діяльності. А також про діяльність громадських організацій, благодійність тощо;
          
          3.3. інформацію, що порушує права інтелектуальної власності третіх осіб (авторське право, права на знаки для товарів і послуг, патентне право, комерційну таємницю тощо), в тому числі використання торгових марок, зображень, текстів та іншої інформації без згоди власника авторських прав (автора);
          
          3.4. інформацію, що порушує особисті (немайнові) права, у т.ч. що містять відомості, які посягають на недоторканність приватного життя, або ображають честь, гідність чи ділову репутацію, фізичних або юридичних осіб;
          
          3.5. матеріали, які містять необґрунтовані звинувачення на адресу людини або компанії, а також наклеп або загрози;
          
          3.6. ненормативну лексику, вульгарні та образливі вирази;
          
          3.7. заклики до страйку, протесту, до насильства та протиправних дій, пропаганду ненависті, насильства, дискримінації, расизму, ксенофобії, міжнаціональних конфліктів;
          
          3.8. інформацію, яка містить елементи жорстокості, насильства, порнографії, цинізму, приниження людської честі та гідності;
          
          3.9. інформацію, спрямовану на надання послуг сексуального характеру (в тому числі, але не обмежуючись, стриптизу, еротичного масажу тощо) і торгівлю людьми;
          
          3.10. зображення: частково або повністю оголених інтимних частин тіла людини; товарів 18+, які мають схожість з інтимними частинами тіла людини, а також зображення чоловіків/жінок, які демонструють застосування товарів 18+. Зображення товарів 18+, які мають схожість з інтимними частинами тіла людини повинні бути заретушовані.
          
          3.11. словесний опис інтимних частин тіла у вульгарній формі, опис або зображення сексуальних відносин;
          
          3.12. інформацію про послуги та товари із зазначенням ціни виключно в іноземній валюті. При цьому, при встановленні ціни в національній валюті не забороняється в товарній позиції також вказувати ціну товару в еквіваленті іноземної валюти;
          
          3.13. інформацію про способи шахрайства, обману, зловживання довірою, а також про способи порушення або обходу чинного законодавства;
          
          3.14. інформацію, що являє собою незаконні комерційні пропозиції (спам-розсилки);
          
          3.15. інформація про разові заходи;
          
          3.16. інформація про продаж алкогольних виробів за цінами, нижчими від мінімальних роздрібних цін, встановлених постановою Кабінету Міністрів України від 30.10.2008 № 657 (Про встановлення розміру мінімальних оптово-відпускних і роздрібних цін на окремі види алкогольних напоїв n16);
          
          3.17. недобросовісну, недостовірну, неетичну інформацію, приховану рекламу, а також інформацію, яка завдає шкоди діловій репутації конкурентів Продавця;
          
          3.18. однакову за своїм змістом та/або смисловим наповненням інформацію на сайті Користувача (в тому числі, але не виключно, часткове або повне співпадіння інформації про товари, його опис, характеристики, ціну, продавця (в тому числі, зазначену в особистому кабінеті);
          
          3.19. відомості про те, що Користувач здійснює маніпуляції з налаштуваннями Сайту і оформленням товарних позицій, а також інші дії, спрямовані на уникнення зняття плати за використання Сервісів, що надаються на Маркетплейсі (наприклад, розміщення контактних даних (номер телефону, e-mail і т.д.) в найменуванні та/або логотипі Продавця, назві та/або описі товарної позиції, на зображенні товару;
          
          3.20. інформацію, що пропагує: війну, національну та релігійну ворожнечу, зміну шляхом насильства конституційного ладу або територіальної цілісності України, фашизм, рашизм та неофашизм, принижує або ображає націю чи особистість за національною ознакою;
          
          3.21. будь-яку іншу інформацію, яка порушує законодавство України і ці Правила.
        `}</Typography>
      </Stack>
    </StyledContainer>
  );
};

export default InfoContent;
