import React from 'react';
import { Link, Stack, Typography, Container } from '@mui/material';

const PrivacyPolicy = () => {
  return (
    <Container maxWidth="xl" disableGutters>
      <Stack spacing={3}>
        <Typography variant="h4">Політика конфіденційності</Typography>
        <Typography fontWeight={600} whiteSpace="pre-line" variant="subtitle2">
          {`1. Загальне
Адміністрація маркетплейсу Yarmarok зобов'язується зберігати вашу конфіденційність в Інтернеті. Ми приділяємо велике значення для охорони даних. Наша політика конфіденційності базується на вимогах `}
          <Link
            sx={{ color: 'text.primary' }}
            href="https://commission.europa.eu/law/law-topic/data-protection_en"
            target="_blank"
          >
            Загального регламенту захисту персональних даних Європейського Союзу
            (GDPR)
          </Link>
          {`. Ми збираємо особисту інформацію для покращення роботи нашого сервісу, здійснення контактів з відвідувачами даного сайту, здійснення послуг, пов'язаних з напрямком діяльності даного сайту, а також для наведених нижче дій.

2. Збір та використання персональних даних
Ми збираємо та використовуємо ваші персональні дані лише у випадку вашої добровільної згоди. За згодою ви дозволяєте нам збирати та використовувати такі дані: ім'я та прізвище, електронну пошту, номер телефону, дані облікових записів у соціальних мережах. Збір та обробка даних проводиться згідно із законами, що діють на території Європейського Союзу та України.

3. Зберігання даних, зміна та видалення
Користувач, який надав свої персональні дані маркетплейсу Yarmarok , має право на їх зміну та видалення, а також відкликання своєї згоди на їх використання. Ваші персональні дані зберігатимуться протягом часу, необхідного для використання даних для основної діяльності сайту, при завершенні використання ваших даних адміністрація сайту видаляє їх. Редагувати свої персональні дані можна в особистому кабінеті. Ми можемо передавати особисті дані третій стороні лише за вашою добровільною згодою. Якщо вони були передані, зміну даних в інших організаціях, які не пов'язані з нами, ми не можемо зробити.

4. Використання технічних даних під час відвідування сайту
При відвідуванні вами сайту Yarmarok в базі даних зберігаються записи про вашу IP адресу, час відвідування, налаштування браузера, операційну систему, а також інша технічна інформація, необхідна для коректного відображення вмісту сайту. За цими даними нам неможливо ідентифікувати особу відвідувача.

5. Надання інформації дітям
На нашому сервісі заборонено залишати особисті дані неповнолітніх без згоди батьків чи опікунів.

6. Використання cookies
Для коректного відображення вмісту та зручності використання сайту Yarmarok ми використовуємо файли cookie. Це невеликі файли, що зберігаються на пристрої. Вони допомагають сайту запам'ятати інформацію про вас, наприклад, якою мовою ви переглядаєте сайт і які сторінки ви вже відкривали, ця інформація буде корисна при наступному відвідуванні. Завдяки файлам cookie перегляд сайту стає зручнішим. Ви можете налаштувати прийом або блокування cookie у браузері самостійно. Неможливість приймати cookie може обмежити працездатність сайту.

7. Посилання на інші сайти
Наш маркетплейс Yarmarok може містити посилання на інші сайти, якими ми не керуємо. Ми не несемо відповідальності за їхнє утримання. Ми рекомендуємо ознайомитися з політикою конфіденційності кожного сайту, який ви відвідуєте, якщо вона є.

8. Зміни у політиці конфіденційності
Наш сайт Yarmarok може оновлювати нашу політику конфіденційності час від часу. Ми повідомляємо про будь-які зміни, розмістивши нову політику конфіденційності на цій сторінці. Ми відстежуємо зміни законодавства щодо персональних даних у Європейському Союзі та Україні. Якщо ви залишили персональні дані у нас, то ми повідомимо вас про зміни в політиці конфіденційності. Якщо ваші персональні дані були введені неправильно, ми не зможемо з вами зв'язатися.

9. Заключні положення
Якщо ви не погоджуєтесь з цією політикою конфіденційності, ви не можете використовувати послуги маркетплейсу Yarmarok, у цьому випадку ви повинні утриматися від відвідування нашого сайту.
`}
        </Typography>
      </Stack>
    </Container>
  );
};

export default PrivacyPolicy;
