import React from 'react';
import { Stack, Typography, Container } from '@mui/material';

const ProhibitedServices = () => {
  return (
    <Container maxWidth="xl" disableGutters>
      <Stack spacing={3}>
        <Typography variant="h4">Заборонені послуги</Typography>
        <Typography variant="body1">ЗАБОРОНЕНІ ПОСЛУГИ</Typography>
        <Typography whiteSpace="pre-line" variant="body1">
          {`5. Продавцям забороняється розміщувати на маркетплейсі інформацію про надання таких послуг:
5.1. послуги з виробництва, виготовлення, зберігання, культивування, перевезення, ввезення та вивезення на/з території України наркотичних засобів, психотропних речовин і прекурсорів, а також рослин, препаратів, що містять такі засоби і речовини та їх аналогів;
5.2. послуги, пов'язані з системами азартних ігор, казино, парі, та будь-яку іншу інформацію про гральний бізнес;
5.3. пропозиції роботи для дівчат в Інтернеті (веб-моделі), ескорт-послуги тощо;
5.4. сумнівні пропозиції роботи, у тому числі в мережі Інтернет без вказівки фізичної адреси та прямих контактів роботодавця («робота для всіх», «обробка електронної пошти на дому», «робота без вкладень» і подібне);
5.5. послуги з купівлі-продажу валюти та криптовалюти, кредитування, надання позик, погашення кредитів, послуги ломбардів, перерахування грошових коштів, поповнення рахунку/аккаунта;
5.6. послуги гіпнотизерів, екстрасенсів, ворожок, спіритів, астрологів, чаклунів, віщунів, інших осіб, що оголошують себе або що вважаються здатними передбачати події, впливати на людей, духовний світ, майно;
5.7. послуги оформлення закордонних паспортів, посвідчень особи та інших документів, видача яких віднесена до компетенції державних органів та установ;
5.8. послуги з коригування пробігу автомобіля;
5.9. послуги з виробництва товарів, перерахованих у п. 4.2 цих Правил;
5.10. послуги щодо збільшення кількості передплатників та репоста у соціальних мережах, месенджерах та інших ресурсах в мережі Інтернет, а також надання доступу до механізмів, що дозволяє здійснювати дільність, що описана у цьому пункті;
5.11. послуги з проведення фотосесії з дикими тваринами (крім зоопарків, цирків і дельфінаріїв);
5.12. Послуги з перевезення та/або розмитнення товарів, що ввозяться/можуть бути ввезені на митну територію України в митному режимі імпорту товарів з Російської Федерації із порушенням норм чинного законодавства України, зокрема Постанови КМУ № 426 від 09.04.2022 р. «Про застосування заборони ввезення товарів з Російської Федерації».`}
        </Typography>
      </Stack>
    </Container>
  );
};

export default ProhibitedServices;
