import React from 'react';
import { StyledContainer } from './style';
import { Stack, Typography } from '@mui/material';
import { Content } from './Content';

const ProhibitedGoods = () => {
  return (
    <StyledContainer maxWidth="xl" disableGutters>
      <Stack spacing={3}>
        <Typography variant="h4">Заборонені товари</Typography>
        <Typography variant="body1">ЗАБОРОНЕНІ ТОВАРИ</Typography>
        <Typography variant="body1">
          4.1. Забороняється продавати/рекламувати товари: ввезені на митну
          територію України в митному режимі імпорту товарів з Російської
          Федерації та товари, країною походження яких є Російська Федерація.
        </Typography>
        <Typography whiteSpace="pre-line" variant="body1">
          {`Забороняється продавати/рекламувати товари, які, зокрема але не виключно:
містять виправдовування, визнання правомірною, заперечення збройної агресії Російської Федерації проти України, у тому числі шляхом представлення збройної агресії Російської Федерації проти України як внутрішнього конфлікту, громадянського конфлікту, громадянської війни, заперечення тимчасової окупації частини території України;
глорифікують: символіку, що використовується (лась) під час збройної агресії Російської Федерації проти України; осіб, які здійснювали збройну агресію Російської Федерації проти України, представників збройних формувань Російської Федерації, іррегулярних незаконних збройних формувань, озброєних банд та груп найманців, створених, підпорядкованих, керованих та фінансованих Російською Федерацією, а також представників окупаційної адміністрації Російської Федерації, яку складають її державні органи та інші структури, функціонально відповідальні за управління тимчасово окупованими територіями України, та представників підконтрольних Російській Федерації самопроголошених органів, які узурпували виконання владних функцій на тимчасово окупованих територіях України, у тому числі шляхом їх визначення як "повстанці", "ополченці", "ввічливі військові люди" тощо.
містять зображення осіб та/або є результатом творчої та іншої діяльності осіб, які виправдовують, визнають правомірною, підтримуютьабо заперечують збройну агресію Російської Федерації проти України;
ввезені на митну територію України в митному режимі імпорту товарів з Російської Федерації;
країною реєстрації торгових марок яких є Російська Федерація та/або власниками торгових марок яких є громадяни Російської Федерації або юридичні особи, створені за законодавством Російської Федерації;
у разі, коли торгові марки, під якими зареєстровані товари, належать афілійованим, зацікавленим особам або кінцевим бенефіціарним власникам компаній, які є громадянами Російської Федерації.
*ми не співпрацюємо з суб’єктами господарювання з Російської Федерації у зв’язку з відкритою та широкомасштабною військовою агресією проти України, введенням воєнного стану в Україні Указом Президента України від 24.02.2022 No 64/2022, затвердженим Законом України від 24.02.2022 No 2102-IX, та з метою уникнення інформаційного впливу держави-агресора на українців.`}
        </Typography>
        <Typography variant="body1">
          4.2. Товари, що підлягають обов'язковій сертифікації, розміщуються на
          Маркетплейсі за умови наявності відповідних дозвільних документів.
        </Typography>

        <Typography whiteSpace="pre-line" variant="body1">
          {`4.3. Перелік товарів, заборонених до публікації на маркетплейсі /сайті:
4.3.1. спеціальні технічні засоби, в тому числі пристрої для негласного отримання відео та аудіо інформації, зняття інформації з каналів зв'язку (приховані та вбудовані камери: брелоки-камери, окуляри з вбудованою камерою, годинник-камера; «прослушка», жучки мікронавушники тощо);
4.3.2. пристрою шифрування та спотворення сигналів та частот (глушники зв'язку, кодграббери та інші засоби електронного злому), відмички дверних замків;
4.3.3. наркотичні засоби, психотропні речовини та прекурсори, включені до переліку, затвердженого Кабінетом Міністрів України (Про затвердження переліку наркотичних засобів, психотропних речовин і прекурсорів ), а також їх аналоги (сибутрамін, фентермин, фенілнітропропен, нітроетан та інші);
4.3.4. об'єкти рослинного світу та насіння, що містять наркотичні, психотропні, галюценогенні, отруйні речовини (канабіс, марихуана, коноплі, тощо);
4.3.5. пристрої та аксесуари для вживання наркотичних і психотропних речовин, а також для вживання і культивування рослин, що їх містять (бонги, напас, бульбулятори, гріндер і т.п.);
4.3.6. людські органи, тканини, клітини, інші анатомічні матеріали (у тому числі, але не обмежуючись: донорська кров та її компоненти), донорські послуги;
4.3.7. браконьєрські інструменти та обладнання для добування об'єктів тваринного світу: електроловильних системи, будь-які рибальські мережі (в т.ч. для промислового лову), раколовки, багри, остроги, ості та інші знаряддя лову, капкани;
4.3.8. представники флори і фауни, занесені до списку міжнародної конвенції СІТЕС та/або включені до Червоної книги, будь-які дикі тварини, а також шкури тварин, вироби зі шкір, роги, кінцівки та опудала з таких тварин;
4.3.9. оптичні носії з нелегальними копіями фільмів, музики, ігор, програмного забезпечення та інших об'єктів інтелектуальної власності або доступ до онлайн ресурсів, їх містить. Під доступом маються на увазі серійні номери, ключі до програмних продуктів і ігор, генератори та інші інструменти, використовувані для зняття захисту від нелегального використання
4.3.10. транспортні засоби без документів або знаходяться в розшуку;
4.3.11. державні нагороди, ордени, медалі, нагрудні знаки до почесного звання і нагрудні знаки лауреатів державних премій за винятком їх копій;
4.3.12. сувенірна та/або інша продукція з нанесенням символіки Російської Федерації, комуністичного тоталітарного режиму, символіки націонал-соціалістичного (нацистського) тоталітарного режиму, самопроголошених держав, не визнаних Україною;
4.3.13. іноземна валюта та інші валютні цінності (за винятком купівлі-продажу монет та купюр для нумізматичних цілей), акції та інші цінні папери, що належать третім особам;
4.3.14. підроблені грошові знаки та підроблені поштові марки, а також поштові марки, що перебувають в обігу без наявності у продавця договору з національним поштовим оператором про продаж таких поштових марок;
4.3.15. посвідчення особи (паспорта, id-карти, права, студентські квитки, і т.п.), документи суворої звітності, а також інші документи та бланки зі спеціальною технічним та голографічним захистом;
4.3.16. готові номерні знаки транспортних засобів (стандартні, іменні, елітні і т.п.), рамки-перевертні (шторки для номерів), також інші товари, які дозволяють приховати / замаскувати / зробити частково невидимим державний номер транспортного засобу, в тому числі в момент фотофіксації порушень ПДР;
4.3.17. бази даних та облікові записи, що містять персональні дані, у тому числі номери телефонів, адреси електронної пошти тощо;
4.3.18. Лікарські засоби та препарати:
які відпускаються за рецептом лікаря;
які відпускаються малолітнім особам (особам, які не досягли чотирнадцяти років);
внесені до переліку заборонених до рекламування;
незареєстровані в Україні;
містять діючі речовини лікарських засобів (у т.ч. силденафіл, тадалафіл, левітра, міноксидил, дапоксетін, мукосат, аванафіл, дженерики віагри тощо);
обмежені у вільному обороті, в тому числі щодо укладення міжнародних компетентних організацій;
ноотропи, стероїди, пептиди, анаболіки.
4.3.19. Лікарські засоби, що не перераховані в цьому пункті, дозволяється рекламувати на маркетплейсі при наявності діючої ліцензії на здійснення господарської діяльності з роздрібної торгівлі лікарськими засобами.
4.3.20. Будь-які засоби/вироби народної (нетрадиційної) медицини не зареєстровані як лікарські засоби або біологічно активні добавки в установленому чинним законодавством України порядку, що не мають відповідних супровідних документів, які підтверджують якість та безпечність таких продуктів, а також препарати, що містять у своєму складі отруйні речовини та які не зареєстровані як лікарські засоби.
4.3.21. Ветеринарні препарати, які не зареєстровані в установленому порядку на території України.
4.3.22. Дієтичні добавки (БАДи, в т.ч. харчові, спортивні, для потенції/лібідо тощо) без наявності міжнародного сертифіката або іншого документа країни походження про його якість та/або укладення уповноваженого органу (СЕС) України про безпечність та якість продукту, а також його статус «дієтичної добавки». Повністю заборонені до розміщення на маркетплейсі /Сайті такі препарати: Тонгкат (Tongkat), Ліда, Далі (DaLi), Міазомі, Баша, Линдакса, ярсагумба, Куаймий, Кан Мей, Віагра, Сіаліс, Рідкісні, Білайт, Чарівний Боб, Чарівні Боби, Голдлайн, Слімекс.
4.3.23. Тютюн, тютюнові вироби, курильні суміші (в т.ч. сигарети, сигари, стіки для приладів для нагрівання тютюну, курильні суміші для кальяну, готові до використання (одноразові) електронні сигарети, будь-які рідини (в тому числі база для виготовлення рідин), картриджі чи поди для електронних сигарет, вейпів та інших приладів для куріння, інші вироби з тютюну чи його замінників), а також продукція з використанням торгових марок та брендів, під якими випускаються тютюнові вироби.
4.3.24. Будь-яка зброя (крім антикварної, сувенірної, конструктивно схожих зі зброєю макетів та муляжів, сигнальних, стартових, будівельних пістолетів, ракетниць, спортивних, туристичних ножів у разі наявності відповідного експертного висновку про те, що такий товар не є холодною зброєю), основні складові частини зброї, патрони до зброї та боєприпаси, включаючи:
вогнепальну зброю, мисливську нарізну та гладкоствольну зброю;
клинкову та комбіновану холодну зброю (ножі, кастет-ножі тощо з довжиною клинка більше 90 мм, товщиною більше 2,6 мм і кутом загострення леза менше 30 градусів);
ударно-дробильну холодну зброю (кастети, дубинки, кистени, нунчаки і т.п.);
метальну холодну зброю (у т.ч. метальні ножі, сюрікени, пращі з клинковим або металевим вражаючим елементом, що відповідає характеристикам клинкової та комбінованої холодної зброї), а також арбалети та луки з силою натягу тятиви більше 20 кг та металевим вражаючим елементом.
Не позначені як заборонені в цьому пункті товари, допускаються до публікації на маркетплейсі /сайті тільки за умови відсутності терміну «зброя» у назві, описі та ключових словах товарної позиції і при наявності дозвільних документів на їх продаж.
4.3.25. Вибухові речовини та особливо небезпечні хімічні речовини (порох, динаміт, тротил, нітрогліцерин тощо);
4.3.26. Піротехнічні вироби технічного та спеціального призначення;
4.3.27. Спеціальні засоби активної самооборони, засоби захисту або обмеження рухливості, що застосовуються правоохоронними органами, а також товари з прихованими елементами травматичної дії (кийки, електрошокові пристрої, тактичні ручки, наручники, газові балончики, газові пістолети, засоби примусової зупинки транспорту, пристрої светозвукового, акустичного та мікрохвильового впливу, засоби, оснащені димоутворювальними препаратами, куботани, явар тощо);
4.3.28. Алкогольні вироби, з вмістом спирту понад 8,5 відсотка об'ємних одиниць, в упаковці типу "Tetra-Pak" та "Bag in box", а також на розлив;
4.3.29. Спирт, в т.ч. етиловий, коньячний, плодовий тощо;
4.3.30. Компоненти та обладнання, призначені, або такі, які можуть бути використані для виготовлення фальсифікованого алкоголю (зокрема, але не виключносамогонні апарати, концентрати, ароматизатори та набори для приготування алкогольної продукції тощо);
4.3.31. Пристрої та обладнання, призначені для зміни показань приладів обліку електроенергії, газу та води (зупинка та открутка лічильників), а також для коригування пробігу автомобіля тощо;
4.3.32. Товари, використання яких несе потенційну небезпеку при керуванні транспортними засобами (заглушки ременя безпеки та кришки-обманки подушок безпеки);
4.3.33. Товари з наявністю надприродних характеристик, здатні впливати на духовний світ, майно, благоустрій тощо;
4.3.34 Товари, продаж та/або використання яких порушує основи правопорядку, не відповідає принципам суспільної моралі та/або моральності;
4.3.35 Пошукове обладнання спеціального призначення (міношукачі, металошукачі для військового застосування ), яке використовується певними спеціальностями військовослужбовців та працівниками поліції, Збройних сил України, які пов’язані із розмінуванням.
Допускаються до публікації на маркетплейсі /сайті металошукачі, які застосовуються лише для пошуку дрібних предметів (металів, прикрас, монет та інших цінностей) і при наявності відповідних документів про безпечність та якість обладнання.
4.3.36. Тактичні армійські кровоспинні джгути (турнікети), крім турнікетів наступних брендів: Combat Application Tourniquet; SAM Extremity Tourniquet (SAM-XT); SOF Tactical Tourniquet-Wide (SOFTT-Wide); Tactical Mechanical Tourniquet (TMT); Ratcheting Medical Tourniquet (RMT) Tactical; TX2 Tourniquet, TX3 Tourniquet (TX2, TX3); "Дніпро" 2-го покоління"; Турнікет SICH. Продаж турнікетів бренду SICH дозволяється на Маркетплейсі за умови пред'явлення Адміністрації Маркетплейсу документів, що підтверджують купівлю цих турнікетів у виробника.
4.3.37. Фальсифіковані товари, з неправомірним використанням знака для товарів та послуг, авторських прав чи копіюванням форми, упаковки, зовнішнього оформлення тощо, в тому числі товари, в назві чи описі яких використовуються слова "копія/точна копія", "репліка", "імітація", "клон", "підробка" тощо.";
4.3.38. Будь-яких інших товарів і послуг, заборонених для продажу та рекламування законодавством України або рішенням Адміністрації маркетплейсу. Будь-яких інших товарів і послуг, заборонених для продажу та рекламування законодавством України або рішенням Адміністрації маркетплейсу.`}
        </Typography>
      </Stack>
      <Content />
    </StyledContainer>
  );
};

export default ProhibitedGoods;
