import React from 'react';
import { StyledContainer } from './style';
import { Stack, Typography } from '@mui/material';
import { Content } from './Content';

const RulesOfUse = () => {
  return (
    <StyledContainer maxWidth="xl" disableGutters>
      <Stack spacing={3}>
        <Typography variant="h4">Загальні вимоги</Typography>
        <Typography whiteSpace="pre-line" variant="body1">{`ЗАГАЛЬНІ ВИМОГИ

          1.1. Публікація інформації (Контенту) на Маркетплейсі та на Веб-сайтах компаній повинна здійснюватися у повній відповідності до вимог чинного законодавства України, Угоди користувача та цих Правил, а також відповідати Правилам оформлення товарних позицій на Маркетплейсі.
          
          1.2. Користувач гарантує, що запропоновані ним товари/послуги відповідають інформації, зазначеної в назві та описі Товарній позиції, вільній від претензій третіх осіб та факт їх розміщення не порушує прав інтелектуальної власності.
          
          1.3. Розміщуючи Контент з пропозицією про продаж товарів із зазначенням торгових марок Користувач гарантує Адміністрації маркетплейсу, що ці товари реалізуються ним на законних підставах (за згодою правовласника або після введення товарів у цивільний оборот ними або уповноваженою собою).
          
          1.4. Розміщуючи інформацію про товари та послуги, що підлягають обов'язковій сертифікації в Україні, або ліцензованих видах діяльності, Користувач несе відповідальність за наявність у нього дозвільних документів.
          
          1.5. У разі обгрунтованих підозр в тому, що товарна позиція по своїй суті несе інформацію про заборонені товари/послуги 
          або спонукає до незаконної діяльності, Адміністрація сайту має право заблокувати доступ до такої інформації без попередження.
          
          1.7. У разі виявлення Адміністрацією маркетплейсу інформації, товарів, послуг, заборонених до публікації згідно цих 
          Правил або законодавства України, або здійснення видів діяльності без обов'язкових дозвільних документів, компанії виставляється попередження про необхідність усунути порушення або Контент буде заблокований автоматично без попередження.
          
          1.9. Продаж товару особам, які не досягли віку, з якого згідно з нормами чинного законодавства України дозволено купівлю такого товару, забороняється.`}</Typography>
      </Stack>
      <Content />
    </StyledContainer>
  );
};

export default RulesOfUse;
