import React from "react";
import { StyledContainer, StyledListItem } from "./style";
import { Stack, Typography, List, ListItem, Link } from "@mui/material";
import { Content } from "./Content";

const SecurityRules = () => {
  return (
    <StyledContainer maxWidth="xl" disableGutters>
      <Stack>
        <Typography variant="h4">
          Як захистити себе при купівлі товарів через Інтернет?
        </Typography>
        <List sx={{ listStyleType: "disc", paddingTop: 2 }}>
          <ListItem
            sx={{ paddingLeft: 0, fontSize: "0.875rem", fontWeight: 600 }}
          >
            Поради, які допоможуть робити покупки в інтернеті безпечно і
            захиститися від шахраїв:
          </ListItem>
          <StyledListItem>
            Створіть окрему поштову електронну скриньку, адресу якої зможете
            залишати на сайтах оголошень під час реєстрації. Ніколи не
            використовуйте робочого e-mail.
          </StyledListItem>
          <StyledListItem>
            Не використовуйте під час купівлі / продажу в інтернеті свого
            фінансового телефонного номера (той, який ви залишаєте у банках і до
            якого «прив’язані» ваші банківські картки).
          </StyledListItem>
          <StyledListItem>
            Замовте окрему банківську картку для покупок в інтернеті. Це може
            бути віртуальна картка. Нікому не повідомляйте секретних реквізитів
            платіжної картки (термін дії, CVV – тризначний код на звороті),
            PIN-коду, паролів до банківських застосунків. Поповнюйте картку лише
            на ту суму, яка потрібна для розрахунку.
          </StyledListItem>
          <StyledListItem>
            Встановіть ліміти на розрахунки банківською карткою в інтернеті. Це
            можна зробити в мобільному застосунку або зателефонувавши в банк.
          </StyledListItem>
          <StyledListItem>
            Спілкуйтеся із продавцями в офіційних чатах маркетплейсу Yarmarok,
            тут зберігається історія повідомлень. Пропозиція перевести
            спілкування у сторонні месенджери або на інші вебсайти має
            насторожити. Не переходьте за посиланнями в оголошеннях або тими,
            які у приватному листуванні може надіслати продавець або покупець.
            Вони можуть бути фішинговими.
          </StyledListItem>
          <StyledListItem>
            Перевіряйте репутацію продавця. Наприклад, загугліть його номер
            телефону (або перевірте в Get contact) чи адресу електронної пошти.
            Можливо, про нього вже були негативні відгуки.
          </StyledListItem>
          <StyledListItem>
            Перевіряйте номер телефону, банківську картку та посилання на
            сумнівний сайт на сайті Кіберполіції у розділі{" "}
            <Link
              sx={{ color: "text.primary" }}
              target="_blank"
              href="https://cyberpolice.gov.ua/stopfraud/"
            >
              "Стоп-фрауд".
            </Link>{" "}
            Можливо, шахраї вже є у базі правоохоронців.
          </StyledListItem>
          <StyledListItem>
            Звертайте увагу на новини, у яких розповідають про поширені схеми
            шахрайства в інтернеті під час купівлі, продажу – або шахрайства під
            виглядом благодійності чи різноманітних виплат і «допомоги від
            держави».
          </StyledListItem>
        </List>
      </Stack>
      <Content />
    </StyledContainer>
  );
};

export default SecurityRules;
